{"/surgeon/docs/":{"data":{"":"Coming Soon"},"title":"Documentation"},"/surgeon/docs/cli/surgeon/":{"data":{"":"","surgeon#surgeon":"surgeon Surgical forks of upstream repositories\nSynopsis Surgeon is a tool to make surgical changes to forks of upstream repositories.\nThe surgeon command reads a configuration file in the current directory named ‘.surgeon.yaml’. This file contains the configuration for the surgeon command. The configuration file contains the upstream repository URL, the directory containing the code modification files, and a list of code modifications to apply to the forked repository.\nThe surgeon command will clone the upstream repository into a temporary directory, then apply the code modifications to the cloned repository. The contents of the modified repository are copied to the current directory, overwriting any existing files.\nImportant: modifications are applied in the order they are listed in the configuration, and have a cumulative effect. Be sure to verify your modifications before committing.\nsurgeon [flags] Options --config string config file (default is .surgeon.yaml) -h, --help help for surgeon --modsdir string directory containing code modification files --upstream string upstream repository -v, --verbose verbose logging SEE ALSO surgeon codemod\t- Work with codemods surgeon completion\t- Generate the autocompletion script for the specified shell surgeon init\t- Initialize a new surgical fork Auto generated by toolbox on 24-Mar-2025 "},"title":"surgeon"},"/surgeon/docs/cli/surgeon_codemod/":{"data":{"":"","surgeon-codemod#surgeon codemod":"surgeon codemod Work with codemods\nSynopsis Commands to work with codemods.\nOptions -h, --help help for codemod Options inherited from parent commands --config string config file (default is .surgeon.yaml) --modsdir string directory containing code modification files --upstream string upstream repository -v, --verbose verbose logging SEE ALSO surgeon\t- Surgical forks of upstream repositories surgeon codemod describe\t- Describe a codemod surgeon codemod list\t- List available codemods Auto generated by toolbox on 24-Mar-2025 "},"title":"surgeon codemod"},"/surgeon/docs/cli/surgeon_codemod_describe/":{"data":{"":"","surgeon-codemod-describe#surgeon codemod describe":"surgeon codemod describe Describe a codemod\nSynopsis Describe a codemod in detail. Show the usage and arguments for a codemod.\nsurgeon codemod describe \u003ccodemod\u003e [flags] Options -h, --help help for describe Options inherited from parent commands --config string config file (default is .surgeon.yaml) --modsdir string directory containing code modification files --upstream string upstream repository -v, --verbose verbose logging SEE ALSO surgeon codemod\t- Work with codemods Auto generated by toolbox on 24-Mar-2025 "},"title":"surgeon codemod describe"},"/surgeon/docs/cli/surgeon_codemod_list/":{"data":{"":"","surgeon-codemod-list#surgeon codemod list":"surgeon codemod list List available codemods\nSynopsis List all available codemods.\nsurgeon codemod list [flags] Options -h, --help help for list Options inherited from parent commands --config string config file (default is .surgeon.yaml) --modsdir string directory containing code modification files --upstream string upstream repository -v, --verbose verbose logging SEE ALSO surgeon codemod\t- Work with codemods Auto generated by toolbox on 24-Mar-2025 "},"title":"surgeon codemod list"},"/surgeon/docs/cli/surgeon_completion/":{"data":{"":"","surgeon-completion#surgeon completion":"surgeon completion Generate the autocompletion script for the specified shell\nSynopsis Generate the autocompletion script for surgeon for the specified shell. See each sub-command’s help for details on how to use the generated script.\nOptions -h, --help help for completion Options inherited from parent commands --config string config file (default is .surgeon.yaml) --modsdir string directory containing code modification files --upstream string upstream repository -v, --verbose verbose logging SEE ALSO surgeon\t- Surgical forks of upstream repositories surgeon completion bash\t- Generate the autocompletion script for bash surgeon completion fish\t- Generate the autocompletion script for fish surgeon completion powershell\t- Generate the autocompletion script for powershell surgeon completion zsh\t- Generate the autocompletion script for zsh Auto generated by toolbox on 24-Mar-2025 "},"title":"surgeon completion"},"/surgeon/docs/cli/surgeon_completion_bash/":{"data":{"":"","surgeon-completion-bash#surgeon completion bash":"surgeon completion bash Generate the autocompletion script for bash\nSynopsis Generate the autocompletion script for the bash shell.\nThis script depends on the ‘bash-completion’ package. If it is not installed already, you can install it via your OS’s package manager.\nTo load completions in your current shell session:\nsource \u003c(surgeon completion bash) To load completions for every new session, execute once:\nLinux: surgeon completion bash \u003e /etc/bash_completion.d/surgeon macOS: surgeon completion bash \u003e $(brew --prefix)/etc/bash_completion.d/surgeon You will need to start a new shell for this setup to take effect.\nsurgeon completion bash Options -h, --help help for bash --no-descriptions disable completion descriptions Options inherited from parent commands --config string config file (default is .surgeon.yaml) --modsdir string directory containing code modification files --upstream string upstream repository -v, --verbose verbose logging SEE ALSO surgeon completion\t- Generate the autocompletion script for the specified shell Auto generated by toolbox on 24-Mar-2025 "},"title":"surgeon completion bash"},"/surgeon/docs/cli/surgeon_completion_fish/":{"data":{"":"","surgeon-completion-fish#surgeon completion fish":"surgeon completion fish Generate the autocompletion script for fish\nSynopsis Generate the autocompletion script for the fish shell.\nTo load completions in your current shell session:\nsurgeon completion fish | source To load completions for every new session, execute once:\nsurgeon completion fish \u003e ~/.config/fish/completions/surgeon.fish You will need to start a new shell for this setup to take effect.\nsurgeon completion fish [flags] Options -h, --help help for fish --no-descriptions disable completion descriptions Options inherited from parent commands --config string config file (default is .surgeon.yaml) --modsdir string directory containing code modification files --upstream string upstream repository -v, --verbose verbose logging SEE ALSO surgeon completion\t- Generate the autocompletion script for the specified shell Auto generated by toolbox on 24-Mar-2025 "},"title":"surgeon completion fish"},"/surgeon/docs/cli/surgeon_completion_powershell/":{"data":{"":"","surgeon-completion-powershell#surgeon completion powershell":"surgeon completion powershell Generate the autocompletion script for powershell\nSynopsis Generate the autocompletion script for powershell.\nTo load completions in your current shell session:\nsurgeon completion powershell | Out-String | Invoke-Expression To load completions for every new session, add the output of the above command to your powershell profile.\nsurgeon completion powershell [flags] Options -h, --help help for powershell --no-descriptions disable completion descriptions Options inherited from parent commands --config string config file (default is .surgeon.yaml) --modsdir string directory containing code modification files --upstream string upstream repository -v, --verbose verbose logging SEE ALSO surgeon completion\t- Generate the autocompletion script for the specified shell Auto generated by toolbox on 24-Mar-2025 "},"title":"surgeon completion powershell"},"/surgeon/docs/cli/surgeon_completion_zsh/":{"data":{"":"","surgeon-completion-zsh#surgeon completion zsh":"surgeon completion zsh Generate the autocompletion script for zsh\nSynopsis Generate the autocompletion script for the zsh shell.\nIf shell completion is not already enabled in your environment you will need to enable it. You can execute the following once:\necho \"autoload -U compinit; compinit\" \u003e\u003e ~/.zshrc To load completions in your current shell session:\nsource \u003c(surgeon completion zsh) To load completions for every new session, execute once:\nLinux: surgeon completion zsh \u003e \"${fpath[1]}/_surgeon\" macOS: surgeon completion zsh \u003e $(brew --prefix)/share/zsh/site-functions/_surgeon You will need to start a new shell for this setup to take effect.\nsurgeon completion zsh [flags] Options -h, --help help for zsh --no-descriptions disable completion descriptions Options inherited from parent commands --config string config file (default is .surgeon.yaml) --modsdir string directory containing code modification files --upstream string upstream repository -v, --verbose verbose logging SEE ALSO surgeon completion\t- Generate the autocompletion script for the specified shell Auto generated by toolbox on 24-Mar-2025 "},"title":"surgeon completion zsh"},"/surgeon/docs/cli/surgeon_gendocs/":{"data":{"":"","surgeon-gendocs#surgeon gendocs":"surgeon gendocs Generates documentation for the project\nSynopsis A longer description that spans multiple lines and likely contains examples and usage of using your command. For example:\nCobra is a CLI library for Go that empowers applications. This application is a tool to generate the needed files to quickly create a Cobra application.\nsurgeon gendocs [flags] Options -b, --basepath string Base path for the documentation (default is /surgeon) (default \"surgeon\") -h, --help help for gendocs Options inherited from parent commands --config string config file (default is .surgeon.yaml) --modsdir string directory containing code modification files --upstream string upstream repository -v, --verbose verbose logging SEE ALSO surgeon\t- Surgical forks of upstream repositories Auto generated by toolbox on 24-Mar-2025 "},"title":"surgeon gendocs"},"/surgeon/docs/cli/surgeon_init/":{"data":{"":"","surgeon-init#surgeon init":"surgeon init Initialize a new surgical fork\nSynopsis The init command will create a new ‘.surgeon.yaml’ file in the current directory.\tThis file will contain the configuration for the surgeon command.\nExample configuration file:\nupstream: https://github.com/community-scripts/ProxmoxVE modsdir: mymods surgeon init [flags] Options -h, --help help for init Options inherited from parent commands --config string config file (default is .surgeon.yaml) --modsdir string directory containing code modification files --upstream string upstream repository -v, --verbose verbose logging SEE ALSO surgeon\t- Surgical forks of upstream repositories Auto generated by toolbox on 24-Mar-2025 "},"title":"surgeon init"},"/surgeon/guides/":{"data":{"":"Coming Soon"},"title":"Guides"},"/surgeon/guides/quickstart/":{"data":{"":"Coming Soon"},"title":"Quick Start"},"/surgeon/installation/":{"data":{"":"You can install surgeon by downloading a release from GitHub or by using our installer script.\nChoose your adventure below.","direct-download#Direct Download":"You can download the binary from the surgeon releases page on GitHub and add to your $PATH.\nThe surgeon_VERSION_checksums.txt file contains the SHA-256 checksum for each file.","installer-script#Installer Script":"We also have an install script which is very useful in scenarios like CI.\nBy default, it installs on the ./bin directory relative to the working directory:\nsh -c \"$(curl --location https://bketelsen.github.io/surgeon/install.sh)\" -- -d It is possible to override the installation directory with the -b parameter. On Linux, common choices are ~/.local/bin and ~/bin to install for the current user or /usr/local/bin to install for all users:\nsh -c \"$(curl --location https://bketelsen.github.io/surgeon/install.sh)\" -- -d -b ~/.local/bin Warning\nOn macOS and Windows, ~/.local/bin and ~/bin are not added to $PATH by default.\nBy default, it installs the latest version available. You can also specify a tag (available in releases) to install a specific version:\nsh -c \"$(curl --location https://bketelsen.github.io/surgeon/install.sh)\" -- -d v0.2.2 "},"title":"Installation"}}